{
    "contentVersion": "1.0.0.0",
    "parameters": {
      "workbookDisplayName": {
        "type": "string",
        "defaultValue": "CISO Dashboard",
        "metadata": {
          "description": "The friendly name for the workbook that is used in the Gallery or Saved List.  This name must be unique within a resource group."
        }
      }
    },
    "variables": {
      "workbookType": "workbook",
      "workbookSourceId": "Azure Monitor",
      "workbookId": "abe1b49f-3g73-48a7-8647-0714489c294f",
      "workbookContent": {
          "version": "Notebook/1.0",
          "items": [
    {
      "type": 1,
      "content": {
        "json": "# CISO Dashboard"
      },
      "customWidth": "80",
      "name": "text - 11"
    },
    {
      "type": 1,
      "content": {
        "json": "<img src=\"https://raw.githubusercontent.com/RakeshPrasad21/SOC/main/mannai/images/Home.png\" alt=\"Mannai\" width=\"150\"/>"
      },
      "customWidth": "20",
      "name": "text - 12"
    },
    {
      "type": 9,
      "content": {
        "version": "KqlParameterItem/1.0",
        "parameters": [
          {
            "id": "64d489ba-dbed-41b7-9492-a466c9e14020",
            "version": "KqlParameterItem/1.0",
            "name": "TimeRange",
            "type": 4,
            "typeSettings": {
              "selectableValues": [
                {
                  "durationMs": 300000
                },
                {
                  "durationMs": 900000
                },
                {
                  "durationMs": 1800000
                },
                {
                  "durationMs": 3600000
                },
                {
                  "durationMs": 14400000
                },
                {
                  "durationMs": 43200000
                },
                {
                  "durationMs": 86400000
                },
                {
                  "durationMs": 172800000
                },
                {
                  "durationMs": 259200000
                },
                {
                  "durationMs": 604800000
                },
                {
                  "durationMs": 1209600000
                },
                {
                  "durationMs": 2419200000
                },
                {
                  "durationMs": 2592000000
                },
                {
                  "durationMs": 5184000000
                },
                {
                  "durationMs": 7776000000
                }
              ]
            },
            "timeContext": {
              "durationMs": 86400000
            },
            "value": {
              "durationMs": 604800000
            }
          }
        ],
        "style": "pills",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "parameters - 1"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityIncident \r\n| where CreatedTime >= ago(7d) and CreatedTime <= now()\r\n| where Severity in ('*') or \"*\" in ('*')\r\n| extend Tactics = todynamic(AdditionalData.tactics)\r\n| where Tactics in ('*') or \"*\" in ('*')\r\n| extend Owner = todynamic(Owner.assignedTo) \r\n| where Owner in ('*') or \"*\" in ('*')\r\n| extend Product = todynamic((parse_json(tostring(AdditionalData.alertProductNames))[0])) \r\n| where Product in ('*') or \"*\" in ('*')\r\n| summarize Incidents=dcount(IncidentNumber) by Severity, bin(CreatedTime, 1d)",
        "size": 0,
        "title": "Sentinel Alert Raised Over Time",
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "areachart"
      },
      "customWidth": "50",
      "name": "query - 9"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityIncident\r\n| where Severity !contains \"Informational\"\r\n| summarize arg_max(TimeGenerated,*) by IncidentNumber\r\n| summarize count() by Title\r\n| top 10  by count_",
        "size": 0,
        "title": "Top 10 Incidents ",
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "barchart"
      },
      "customWidth": "50",
      "name": "query - 10"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityIncident\r\n| where Severity !contains \"Informational\"\r\n| summarize arg_max(TimeGenerated, *) by IncidentNumber\r\n| where Severity contains \"High\" and Status != \"Closed\"\r\n| extend times=  now() - CreatedTime\r\n| extend time1= toreal(times)\r\n| extend time2= time1 / 10000000\r\n| extend time3= toint(time2)\r\n| extend time4=time3 / 3600\r\n| project time4, Title, IncidentNumber, TimeGenerated",
        "size": 1,
        "title": "High Severity Incident By Ageing",
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "tiles",
        "tileSettings": {
          "titleContent": {
            "columnMatch": "Title",
            "formatter": 1
          },
          "leftContent": {
            "columnMatch": "time4",
            "formatter": 12,
            "formatOptions": {
              "palette": "auto"
            },
            "numberFormat": {
              "unit": 27,
              "options": {
                "style": "decimal",
                "maximumFractionDigits": 2,
                "maximumSignificantDigits": 3
              }
            }
          },
          "showBorder": false
        }
      },
      "customWidth": "50",
      "name": "query - 2"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityIncident\r\n| extend Tactics = todynamic(AdditionalData.tactics)\r\n| extend Owner = todynamic(Owner.assignedTo) \r\n| extend Product = todynamic((parse_json(tostring(AdditionalData.alertProductNames))[0])) \r\n| summarize arg_max(TimeGenerated,*) by IncidentNumber \r\n| extend TimeToClosure =  (ClosedTime - CreatedTime)/1h\r\n| summarize 50th_Percentile=percentile(TimeToClosure, 50)",
        "size": 0,
        "title": "Mean Time To Close",
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "tiles",
        "tileSettings": {
          "titleContent": {},
          "subtitleContent": {
            "columnMatch": "50th_Percentile",
            "formatter": 12,
            "formatOptions": {
              "palette": "auto"
            },
            "numberFormat": {
              "unit": 27,
              "options": {
                "style": "decimal"
              }
            }
          },
          "showBorder": false,
          "size": "auto"
        }
      },
      "customWidth": "20",
      "name": "query - 6"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityIncident\r\n| where Severity !contains \"Informational\"\r\n| summarize arg_max(TimeGenerated,*) by IncidentNumber\r\n| extend Comments = parse_json(Comments)\r\n| mv-expand Comments\r\n| extend Comment = parse_json(Comments.message)\r\n| where isnotempty( Classification)\r\n| summarize count() by Classification\r\n| render piechart ",
        "size": 0,
        "title": "Incident Classification",
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "customWidth": "30",
      "name": "query - 5"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityIncident\r\n| where Severity !contains \"Informational\"\r\n| summarize arg_max(TimeGenerated,*) by IncidentNumber\r\n| summarize count() by  Status,Severity",
        "size": 0,
        "title": "High-Medium-Low Incident Status",
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "barchart",
        "chartSettings": {
          "xAxis": "Severity",
          "showLegend": true
        }
      },
      "customWidth": "50",
      "name": "query - 0"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityIncident\r\n| where Severity !contains \"Informational\"\r\n| summarize arg_max(TimeGenerated, *) by IncidentNumber\r\n| extend Comments = parse_json(Comments)\r\n| mv-expand Comments\r\n| extend Comment = parse_json(Comments.message)\r\n| project\r\n    TimeGenerated,\r\n    IncidentNumber,\r\n    Severity,\r\n    Title,\r\n    CreatedTime,\r\n    NotfiedTime=FirstModifiedTime,\r\n    Status,\r\n    ClassificationComment,\r\n    Comment\r\n| union (SecurityIncident\r\n    | where Severity !contains \"Informational\"\r\n    | summarize arg_max(TimeGenerated, *) by IncidentNumber\r\n    | where Comments == \"[]\"\r\n    | project\r\n        TimeGenerated,\r\n        IncidentNumber,\r\n        Severity,\r\n        Title,\r\n        CreatedTime,\r\n        NotfiedTime=FirstModifiedTime,\r\n        Status,\r\n        ClassificationComment,\r\n        Comment=Comments)\r\n| extend Raised = iif(Comment contains \"https\", iif(Comment !contains \"Already\", \"Raised\", \"Closed\"), \"Closed\")\r\n| summarize count() by Raised, bin(TimeGenerated, 1d)",
        "size": 0,
        "title": "Incident Raised Over Time",
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "barchart",
        "chartSettings": {
          "xAxis": "TimeGenerated"
        }
      },
      "customWidth": "50",
      "name": "query - 0 - Copy"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityAlert\r\n| where AlertSeverity !contains \"Informational\"\r\n| summarize count() by AlertName, Tactics",
        "size": 0,
        "title": "Incidents with MITRE Mapping",
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "barchart",
        "chartSettings": {
          "xAxis": "Tactics",
          "showLegend": true
        }
      },
      "name": "query - 4"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityIncident\r\n| where LastActivityTime >= ago (7d) and LastModifiedTime <= now()\r\n| where FirstModifiedTime >= ago(7d) and FirstModifiedTime <= now()\r\n| where Severity in ('*') or \"*\" in ('*')\r\n| extend Tactics = todynamic(AdditionalData.tactics)\r\n| where Tactics in ('*') or \"*\" in ('*')\r\n| extend Owner = todynamic(Owner.assignedTo) \r\n| where Owner in ('*') or \"*\" in ('*')\r\n| extend Product = todynamic((parse_json(tostring(AdditionalData.alertProductNames))[0])) \r\n| where Product in ('*') or \"*\" in ('*')\r\n| summarize arg_max(LastModifiedTime,  *) by IncidentNumber \r\n| summarize arg_max(TimeGenerated, *) by IncidentNumber \r\n| extend TimeToDetect =  (FirstModifiedTime - CreatedTime) / 1h\r\n| extend TimeToRespond =  (LastModifiedTime- CreatedTime) / 1h\r\n| summarize MTTD=percentile(TimeToDetect, 50),  MTTR=percentile(TimeToRespond, 50)by bin(CreatedTime, 1d)",
        "size": 0,
        "title": "Mean Time To detect and respond",
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "barchart"
      },
      "name": "query - 6 - Copy"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "Usage\r\n| where TimeGenerated > startofday(ago(1d))\r\n| where StartTime > startofday(ago(1d))\r\n| where IsBillable == true\r\n| summarize TotalVolumeGB = sum(Quantity) / 1000 by bin(StartTime, 1d), DataType\r\n| order by StartTime",
        "size": 0,
        "title": "Per Day Ingestion By Device Type",
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "barchart"
      },
      "name": "query - 8"
    }
  ],
          "fallbackResourceIds": [
            "Azure Monitor"
          ],
          "fromTemplateId": "sentinel-UserWorkbook"        
      }
    },
    "resources": [
      {
        "name": "[variables('workbookId')]",
        "type": "microsoft.insights/workbooks",
        "location": "[resourceGroup().location]",
        "apiVersion": "2021-03-08",
        "dependsOn": [],
        "kind": "shared",
        "properties": {
          "displayName": "[parameters('workbookDisplayName')]",
          "serializedData": "[string(variables('workbookContent'))]",
          "version": "1.0",
          "sourceId": "[variables('workbookSourceId')]",
          "category": "[variables('workbookType')]"
        }
      }
    ],
    "outputs": {
      "workbookId": {
        "type": "string",
        "value": "[resourceId( 'microsoft.insights/workbooks', variables('workbookId'))]"
      }
    },
    "$schema": "http://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
  }
